<template>
    <div class="container">
      <h1>CYPHER隐私政策</h1>
      <div class="date">
          <p>公布日期：2024年1月1日</p>
      </div>
      <p>感谢您使用CYPHER系统（以下简称“本系统”）。我们非常重视您的隐私保护，确保您的个人信息安全。本隐私政策旨在向您说明我们如何收集、使用、存储和保护您的信息，请您在使用本系统之前仔细阅读本隐私政策。</p>
  
      <h2>1. 信息收集与使用</h2>
      <ul>
        <li><strong>基本信息：</strong>包括但不限于您的用户名、设备信息、IP地址、操作系统、浏览器类型等技术性数据。</li>
        <li><strong>监控数据：</strong>当您使用本系统监控功能时，我们将收集您设备的系统状态、进程信息、CPU/GPU使用率、内存使用情况、磁盘状态等数据。该数据仅用于系统监控与优化，并会在后台进行加密存储。</li>
        <li><strong>远程控制数据：</strong>如果您使用远程控制功能，本系统将记录您的操作指令，例如进程关闭、启动等。</li>
        <li><strong>用户反馈信息：</strong>如您提交问题、反馈或建议时，我们将收集您的反馈信息，以帮助优化我们的服务。</li>
      </ul>
      <p>我们仅会在以下情况下使用收集的信息：</p>
      <ul>
        <li>提供、维护和优化本系统的功能和服务。</li>
        <li>进行安全监控，及时发现并处理潜在的安全问题。</li>
        <li>向您推送系统更新或重要通知。</li>
        <li>改进用户体验，并进行数据分析。</li>
      </ul>
  
      <h2>2. 信息存储与保护</h2>
      <ul>
        <li><strong>数据存储：</strong>我们将会妥善存储您的数据，所有敏感数据（如监控数据）将采用加密存储在我们的数据库中，且数据仅限于本系统内部使用。</li>
        <li><strong>信息安全：</strong>我们采取了包括防火墙、数据加密等技术措施来保护您的信息安全，防止您的个人数据遭到未经授权的访问、披露、更改或删除。</li>
      </ul>
  
      <h2>3. 信息共享与披露</h2>
      <ul>
        <li>我们承诺不会将您的个人信息出售、租赁或以其他形式与第三方共享，除非获得您的明确同意或法律法规要求我们必须披露。</li>
        <li>在发生法律事务或对我们权利的保护过程中，我们可能会在法律允许的范围内披露您的信息。</li>
      </ul>
  
      <h2>4. 数据存储地点</h2>
      <p>您的个人信息和监控数据将存储在我们选择的合规服务器中。根据不同地区的法律法规，您的信息可能会存储在您所在地区或其他地区的服务器上，但我们将确保所有的存储活动符合当地法律规定。</p>
  
      <h2>5. 用户权利</h2>
      <ul>
        <li><strong>访问与更新：</strong>您可以随时通过系统设置查看、更新或删除您提供的个人信息。</li>
        <li><strong>删除请求：</strong>如您希望停止使用我们的服务，您可以通过系统中的退出选项删除账户信息。删除后，我们将尽力清除您在我们的服务器上的数据。</li>
        <li><strong>限制处理：</strong>您可以申请限制我们对您信息的某些处理方式。</li>
      </ul>
  
      <h2>6. 儿童隐私</h2>
      <p>本系统不适用于未满18岁的儿童。如果我们得知有未成年用户提供个人信息，我们将会采取措施立即删除该信息。我们鼓励家长或监护人监控孩子的网络使用，确保其不向我们提供任何个人信息。</p>
  
      <h2>7. 第三方服务</h2>
      <p>在本系统中可能会嵌入第三方服务（例如：云存储、数据处理平台等）。这些第三方服务商的隐私政策与我们无关。我们建议您在使用这些第三方服务前，查看它们的隐私政策。</p>
  
      <h2>8. 隐私政策的变更</h2>
      <p>我们可能会不时更新本隐私政策。每次更新后，我们将通过系统内的通知或更新日期提醒您。您继续使用本系统即表示您同意更新后的隐私政策。如果您不同意修改后的隐私政策，您可以选择停止使用本系统。</p>
  
      <h2>9. 联系方式</h2>
      <p>如果您对本隐私政策有任何疑问或需要进一步了解如何处理您的个人信息，您可以通过以下方式与我们联系：</p>
      <ul>
        <li>电子邮件：[1234567890@qq.com]</li>
        <li>客服电话：[1234567890]</li>
        <li>公司地址：[江苏省南京市南京邮电大学]</li>
      </ul>
  
      <p>感谢您使用CYPHER系统！我们将继续努力保护您的隐私安全。</p>
      <p>更新日期：2024年12月3日</p>
    </div>
  </template>
  
  <script>
  export default {
    name: 'Privacy',
  }
  </script>
  
  <style scoped>
  .container {
    padding: 0 300px;
  }
  
  h1 {
    margin-top: 20px;
    text-align: center;
    font-size: 24px;
  }
  .date {
    text-align: right;
    margin-right: 10px;
  }
  
  h2 {
    font-size: 20px;
    margin-top: 20px;
    margin-bottom: 10px;
  }
  
  p {
    font-size: 16px;
    line-height: 1.6;
  }
  
  ul {
    display: flex;
    flex-direction: column;
    margin-left: 20px;
    list-style-type: disc;
  }
  
  ul li {
    margin-bottom: 12px; /* 增加列表项之间的间距 */
    margin-top: 4px;    /* 增加列表项之间的间距 */
  }
  </style>
  